{
  "navbar": {
    "home": "Home",
    "about": "About",
    "why": "Why",
    "stories": "stories",
    "team": "Team",
    "robots": "Robots",
    "configure": "Configure",
    "start": "In Education",
    "developers": "For Developers",
    "primary": "Primary education",
    "secondary": "Secondary education",
    "higher": "Higher education",
    "workshops": "Workshops",
    "docs": "Documentation",
    "meet": "Meet Mirte"
  },
  "footer": "is being developed by",
  "home": {
    "home": "A modular, affordable and open-source robotplatform for education - from primary school up to university.",
    "title": "Discover Robotics. Step by step. With MIRTE.",
    "modular_text": "Build and learn at your own level.",
    "open_text": "Discover, modify, and share.",
    "affordable_text": "Get started from €20 per robot.",
    "mission_text_1": "MIRTE makes robotics accessible by building up complex technology step by step. It combines scaffolding, active learning, and project-based learning, enabling pupils and students to experience ownership and gain confidence in their technical skills.",
    "mission_text_2": "In recent years, MIRTE has already contributed to winning several awards. Thanks to the use of MIRTE, the NUVO received the {strongStart}Mekel Prize{strongEnd} in 2024. In 2025, our efforts were recognized with the {strongStart}SURF Education Award{strongEnd}.",
    "read_more_why": "Read more about why we are designing MIRTE",
    "for_who": "Who is MIRTE for?",
    "for_who_text_1": "MIRTE is designed to grow along with every learner, from primary school to university. The platform offers a unique learning experience in which technology is made accessible step by step. Thanks to its modular setup, users can start at their own level and gradually progress toward more complex applications.",
    "for_who_text_2": "For young learners, this means an initial introduction to technology in a safe and playful environment. They build simple robots and gradually discover how mechanics and programming come together. For students in higher education, MIRTE offers the opportunity to work in a multidisciplinary way on challenging projects where mechanics, electronics, and software meet. This creates a learning environment in which experimentation is central and making mistakes is part of the learning process.",
    "read_more_for": "Read more about this layered design",
    "getting_started": "Getting started with MIRTE",
    "choose_your_mirte": "Choose which MIRTE you want to start with.",
    "start_learning": "Start working with the learning materials.",
    "do_workshop": "Ór follow one of the on-site workshops."
  },
  "about":{
    "why":{
      "mission": "'s Mission",
      "mission_text": "{strongStart}Our mission is to inspire students in science and engineering.{strongEnd} With the MIRTE robot we are able to create meaningful hands-on learning experiences across multiple engineering disciplines. As an {strongStart}open{strongEnd}, {strongStart}modular{strongEnd}, and {strongStart}affordable{strongEnd} platform, MIRTE makes robotics accessible for learners from primary school to university level.",
      "pillars": "'s Three Pillars",
      "open": "Open",
      "open_text": "MIRTE is fully open-source. Both software and hardware are freely available, allowing educators to adapt, extend, and share the platform. For students, this means they are never limited by proprietary systems—they can always explore how everything works and learn in depth.",
      "modular": "Modular",
      "modular_text": "MIRTE is designed with modularity at its core. Every component can be replaced, upgraded, or reconfigured, and most parts are off-the-shelf and interchangeable. This allows educators to choose configurations that fit their learning goals, while students can experiment freely, combine components in new ways, and create their own solutions.",
      "affordable": "Affordable",
      "affordable_text": "MIRTE uses low-cost, accessible components and offers multiple levels of complexity, making it suitable for any budget. This allows educators to work with smaller groups, while students benefit from a richer, more engaging learning experience.",
      "layered_modular_design": "Layerend Modular Design",
      "layered_modular_design_text": "In our design, we have introduced multiple layers of complexity across different disciplines—mechanics, programming, and electronics. At its core, MIRTE is an advanced robot developed with state-of-the-art technologies. This complexity is gradually revealed through simplified “layers,” creating a continuous learning pathway that allows students to explore progressively deeper and more complex concepts. For educators, this approach provides the flexibility to tailor the level of complexity—per discipline or in a multidisciplinary way—according to their learning objectives and the students’ level."
    }
  },
  "stories": {
    "media": "In the media",
    "publications": "Publications"
  },
  "configure": {
    "chose": "CHOOSE YOUR ITEMS",
    "single_board_computer": "Single Board Computer",
    "micro_controller": "Micro Controller",
    "motor_controller": "Motor Controller",
    "wiring": "Wiring",
    "motors": "Motors",
    "misc": "Misc",
    "power": "Power Supply",
    "actuators": "Actuators (optional)",
    "sensors": "Sensors (optional)",
    "orange_pi_zero2": "Orange Pi Zero 2",
    "raspberry_pi": "Raspberry Pi 4/5",
    "raspberry_pico": "Raspberry Pi Pico H",
    "arduino_uno": "Arduino Uno",
    "arduino_nano": "Arduino Nano",
    "stm32": "STM32",
    "l9110s": "L9110S",
    "l298n": "L298N",
    "mx1919": "MX1919",
    "breadboard": "Breadboard (Dupont)",
    "pcb": "MIRTE PCB (JST)",
    "yellow_motor": "3-6V Yellow DC Motor (2x)",
    "blue_motor": "3-6V Blue DC Motor incl encoder (2x)",
    "sd_card": "16GB SD Card",
    "caster_wheel": "Ball caster wheel",
    "wheel": "Yellow wheel (2x)",
    "m3": "M3 nuts and bolts",
    "frame_bottom": "Frame (bottom plate)",
    "frame_full": "Frame (full)",
    "power_bank": "5V Power Bank",
    "breadboard_supply": "Breadboard Power (MB102)",
    "usb_cable": "Micro USB cable",
    "servo": "SG90 Servo (2x)",
    "oled": "128x64 I2C Oled (2x)",
    "reflectance_sensor": "Reflectance (TCRT5000) (2x)",
    "light_sensor": "Light LDR (LM393) (2x)",
    "ir_obstacle_sensor": "IR obstacle (2x)",
    "us_distance_sensor": "Ultrasonic Distance (HC-SR04) (2x)",
    "keypad": "5 Key Keypad",
    "camera": "USB Camera"
  },
  "robots": {
    "lite": "Start learning about basic electronics and robot behaviour. By connecting two sensors to the motors (using the motor controller) one can build a robot that reacts to the sensors. Moving away from or towards the light, or not bumping into obstacles.",
    "basic": "Learn about software (block-based and Python). By adding a microcontroller one can create more complex behaviours and use more sensors.",
    "pioneer": "Explore all robotic possibilities. By adding a computer one can use even more sensors (camera, but even lidar) and a gripper. Apart from programming in blocks and Python, one can also use all possibilites of Robot Operating System (ROS).",
    "master": "Upgraded version of all hardware, focussing on development and learning about robot applications. Includes a 2D lidar, 3D depth camera, omnidirectional wheels, and a 4DOF manipulator.\n\nWe are curretnly working on a new version which we will fully open source.",
    "start": "Get started with"
  },
  "start": {
    "coming_soon": "Coming soon",
    "construction": "We are currently still finalizing this part of the robot.",
    "download_frame": "Download Frame",
    "select_frame_text": "Select the type of frame and download the accompanying files",
    "download_frame_text": "Download the files of the 3mm lasercut frame of MIRTE",
    "lasercut": "DXF - lasercut 3mm plywood",
    "3dprint": "STL - 3D print",
    "dxf_source": "FreeCAD source files",
    "get_hardware": "Get Hardware",
    "get_hardware_text": "Select your robot hardware, and check the essential parts in the",
    "get_hardware_lite_text": "Check the hardware you need in the",
    "download_software": "Download Software",
    "select_software_text": "Select the SD card image for your Single Board Computer",
    "download_software_text": "Download the SD card image for the computer",
    "software_source_release": "Source code of latest release",
    "software_source_latest": "Latest source code",
    "build_and_learn": "Build and Learn",
    "build_and_learn_text": "Follow the build instructions and check out the",
    "documentation": "documentation",
    "workshops": "workshops",
    "download": "Download",
    "select_robot": "Please select a MIRTE robot",
    "getting_started_with": "Getting started with",
    "build": "Build",
    "build_robot": "Build you robot using the instructions",
    "program_ide": "Program",
    "program_ide_text": "Start programming your robot in the",
    "customize": "Customize your",
    "select_robot_secondary_text": "At secondary level you can start with the MIRTE Basic, or the MIRTE Pioneer.",
    "select_robot_primary_text": "At primary level you can start with the MIRTE Lite, or the MIRTE Basic.",
    "select_robot_higher_text": "At primary level you can start with the MIRTE Pioneer, or the MIRTE Master.",
    "select_robot_all_text": "You can find the overview of the MIRTE family below."
  },
  "mirte_complexity":{
    "mechanical": "Mechanical",
    "programming": "Programming",
    "electronics": "Electronics",
    "design": "Design",
    "JST": "PCB + JST cables",
    "blocks": "Visual Programming/Blocks",
    "manufacturing": "Manufacturing",
    "breadboard": "Breadboard",
    "python": "Python",
    "CAD": "CAD/CAM",
    "PCB": "PCB Design",
    "ROS": "Linux/ROS2"
  },
  "meet":{
    "workshops": "Workshops",
    "events": "Events",
    "weekends": "Every weekend",
    "annual": "Anually",
    "onrequest": "On request",
    "workshops_text": "There are multiple institutions organizing workshops with the MIRTE robot.",
    "events_text": "MIRTE is also present at conferences, makerfaires, summerschools and other events."
  }
}

